# THIS FILE IS AUTOMATICALLY GENERATED
# Project: H:\CarLab\Car_Lab_Code\BallCatcher_Copy_01.cydsn\BallCatcher_Copy_01.cyprj
# Date: Tue, 03 May 2016 02:48:14 GMT
#set_units -time ns
create_clock -name {ADC_Ext_CP_Clk(routed)} -period 1000 -waveform {0 500} [get_pins {ClockBlock/dclk_5}]
create_clock -name {Clock_1(routed)} -period 20000000 -waveform {0 10000000} [get_pins {ClockBlock/dclk_7}]
create_clock -name {CyIMO} -period 333.33333333333331 -waveform {0 166.666666666667} [list [get_pins {ClockBlock/imo}]]
create_clock -name {CyPLL_OUT} -period 41.666666666666664 -waveform {0 20.8333333333333} [list [get_pins {ClockBlock/pllout}]]
create_clock -name {CyILO} -period 1000000 -waveform {0 500000} [list [get_pins {ClockBlock/ilo}] [get_pins {ClockBlock/clk_100k}] [get_pins {ClockBlock/clk_1k}] [get_pins {ClockBlock/clk_32k}]]
create_clock -name {CyMASTER_CLK} -period 41.666666666666664 -waveform {0 20.8333333333333} [list [get_pins {ClockBlock/clk_sync}]]
create_generated_clock -name {PWM_clk} -source [get_pins {ClockBlock/clk_sync}] -edges {1 3 7} [list [get_pins {ClockBlock/dclk_glb_0}]]
create_generated_clock -name {tilt_reset_clk} -source [get_pins {ClockBlock/clk_sync}] -edges {1 25 49} [list [get_pins {ClockBlock/dclk_glb_1}]]
create_generated_clock -name {timer_clock_1} -source [get_pins {ClockBlock/clk_sync}] -edges {1 25 49} [list [get_pins {ClockBlock/dclk_glb_2}]]
create_generated_clock -name {timer_clock} -source [get_pins {ClockBlock/clk_sync}] -edges {1 25 49} [list [get_pins {ClockBlock/dclk_glb_3}]]
create_generated_clock -name {pan_reset_clk} -source [get_pins {ClockBlock/clk_sync}] -edges {1 25 49} [list [get_pins {ClockBlock/dclk_glb_4}]]
create_generated_clock -name {ADC_Ext_CP_Clk} -source [get_pins {ClockBlock/clk_sync}] -edges {1 25 49} [list [get_pins {ClockBlock/dclk_glb_5}]]
create_generated_clock -name {Pixy_UART_IntClock} -source [get_pins {ClockBlock/clk_sync}] -edges {1 157 313} [list [get_pins {ClockBlock/dclk_glb_6}]]
create_generated_clock -name {ADC_theACLK} -source [get_pins {ClockBlock/clk_sync}] -edges {1 189 377} [list [get_pins {ClockBlock/aclk_glb_0}]]
create_generated_clock -name {Clock_1} -source [get_pins {ClockBlock/clk_sync}] -edges {1 50505 960001} [list [get_pins {ClockBlock/dclk_glb_7}]]
create_generated_clock -name {CyBUS_CLK} -source [get_pins {ClockBlock/clk_sync}] -edges {1 2 3} [list [get_pins {ClockBlock/clk_bus_glb}]]

set_false_path -from [get_pins {__ONE__/q}]

# Component constraints for H:\CarLab\Car_Lab_Code\BallCatcher_Copy_01.cydsn\TopDesign\TopDesign.cysch
# Project: H:\CarLab\Car_Lab_Code\BallCatcher_Copy_01.cydsn\BallCatcher_Copy_01.cyprj
# Date: Tue, 03 May 2016 02:48:01 GMT
